import {generateRating} from "./csvParser.js";

const testText = "44.38,34.33,Алушта,31440,\n" +
    "49.46,30.17,Біла Церква,200131,\n" +
    "49.54,28.49,Бердичів,87575,#некомент\n" +
    "\n" +
    "#\n" +
    "46.49,36.58,#Бердянськ,121692,\n" +
    "49.15,28.41,Вінниця,356665,\n" +
    "49.15,28.41,Київ,2000000,\n" +
    "49.15,28.41,Львів,600000,\n" +
    "49.15,28.41,Кривий Ріг,1000000,\n" +
    "49.15,28.41,Чоп,100000,\n" +
    "49.15,28.41,Чернігів,103000,\n" +
    "49.15,28.41,Суми,120000,\n" +
    "49.15,28.41,Харків,300000,\n" +
    "49.15,28.41,Дніпро,300000,\n" +
    "#45.40,34.29,Джанкой,43343,\n" +
    "\n" +
    "# в цьому файлі три рядки-коментарі :)"

const generator = generateRating(testText)
console.log(generator("Я народився у Київ"));
